import functions_markers_check
import message_extraction
# імпортуємо бібліотеку telebot для взаємодії з Телеграм ботом та під'єднуємось до конкретного бота за токеном
import telebot
from telebot import types
bot = telebot.TeleBot(
    '...', parse_mode='html')


# задаємо команду "/start" із першим повідомленням-привітанням бота та двома кнопками-опціями наступних дій для користувача
@bot.message_handler(commands=['start'])
def start(message):
    m = f'''Вітаю, {message.from_user.first_name}!

Я бот <b>Звір – канал</b>, який допомагає відрізнити доброчесні новинні Телеграм-канали від таких, що не заслуговують на довіру.

Щоб перевірити канал або дізнатися більше про критерії перевірки, натисніть одну з кнопок у меню нижче ⬇️
'''

    markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
    btn1 = types.KeyboardButton('Перевірити канал 🐾')
    btn2 = types.KeyboardButton('Критерії перевірки ✅')
    btn3 = types.KeyboardButton('Про недоброчесні канали 📚')
    markup.add(btn1, btn2)
    markup.add(btn3)
    bot.send_message(message.chat.id, m, reply_markup=markup)


# визначаємо повідомлення реакції на кнопки з першого блоку та відповідні блоки-функції, які оброблятимуть подальший запит
@bot.message_handler(content_types=['text'])
def get_text(message):
    if message.text == 'Перевірити канал 🐾':
        bot.send_message(
            message.chat.id, '''
Надішліть покликання на новинний канал, який ви хотіли б перевірити. Обробка триватиме 5-10 хвилин.
''')
        bot.register_next_step_handler(message, process_link)


    elif message.text == 'Критерії перевірки ✅':
        bot.send_message(
            message.chat.id, '''
<b>Критеріями перевірки</b> новинних Телеграм-каналів у <b>Звір – канал</b> є екстралінгвістичні та лінгвістичні показники. Отримавши покликання на канал, бот обраховує середню частоту внутрішніх та зовнішніх покликань на каналі, використання емодзі та верхнього регістру, а також частоти власних назв і частин мови (прикметників, прислівників, числівників, займенників і часток).

<b>Чому саме ці критерії?</b>
Ретельне вивчення матеріалів новинних Телеграм-каналів, а також досліджень на тему неправдивих новин показало, що перелічені вище критерії є яскравими маркерами використання маніпуляцій у текстах новин.

Так, наприклад, недоброчесні новинні Телеграм-канали частіше використовують:
 >  <b>покликання</b> – в проплачених рекламних матеріалах;
 >  <b>емодзі</b> – для привернення уваги читача до контенту;
 >  <b>верхній регістр</b> – в клікбейтних заголовках;
 >  <b>вищий та найвищий ступені порівняння прикметників</b> – в проплачених рекламних матеріалах;
 >  <b>прислівники</b> – для підсилення суб'єктивних думок чи емоційного забарвлення інформації;
 >  <b>займенники</b>, зокрема першої (<i>я</i>, <i>ми</i>) та другої (<i>ти</i>, <i>ви</i>) особи – для персоналізації контенту;
 >  <b>частки</b> – для формування маніпулятивних спонукальних або заперечувальних висловлювань.

Натомість доброчесні Телеграм-канали схильні частіше використовувати:
 >  <b>власні назви</b>;
 >  <b>прикметники</b>;
 >  <b>числівники написані текстом</b>.

Щоб перевірити канал або дізнатися більше про недоброчесні канали, натисніть одну з кнопок у меню нижче ⬇️
''')
        

    elif message.text == 'Про недоброчесні канали 📚':
        bot.send_message(
            message.chat.id, '''
Після російського вторгнення в Україну 24 лютого 2022 року <b>Телеграм</b> став основним джерелом новин для українців. Тут громадяни читають актуальні новини, дізнаються про запуск російських ракет у напрямку своїх міст, отримують інформацію про руйнування та загиблих.

Однак новинні телеграм-канали журналістських видань нині губляться серед численних <b>анонімних каналів, які поширюють чутки та російські фейки</b>. Такі джерела активізуються під час тривоги, намагаючись заробити на читачах, а також публікують рекламу, паразитуючи на страхах людей. Деякі з анонімних Телеграм-каналів попри заборону також досі публікують роботу ППО в режимі реального часу та викладають фото й відео руйнувань одразу після удару російських ракет. Цю інформацію активно використовує ворог для коригування ударів.

Саме тому, <b>щоб не стати жертвою маніпуляцій і російського ІПСО</b>, а також не поширювати неправдиву інформацію далі, допомагаючи ворогу, важливо перевіряти новинні Телеграм-канали на доброчесність.
З цим вам може допомогти бот <b>Звір – канал</b>, який перевіряє новини з джерела за ключовими критеріями та повідомляє, чи присутні на каналі ознаки маніпулятивного контенту.

Але якщо після перевірки виявиться, що ваші улюблені джерела новин схильні до маніпуляцій, не засмучуйтесь. Інститут Масової Інформації вже уклав для вас <b><a href='https://imi.org.ua/news/bilyj-spysok-11-media-shho-staly-najyakisnishymy-i60964'>білий список перевірених медіа</a></b>, яким точно можна довіряти. Серед них:
     –  <b>Суспільне</b> (@suspilnenews)
     –  <b>Радіо Свобода</b> (@svoboda_radio)
     –  <b>Українська правда</b> (@ukrpravda_news)
     –  <b>Бабель</b> (@babel)
     –  <b>Громадське</b> (@hromadske_ua)
     –  <b>Тексти</b> (@textyorgua)
     –  <b>Громадське радіо</b> (https://hromadske.radio/)
     –  <b>ZN,UA</b> (@znua_live)
     –  <b>Еспресо</b> (@espresotb)
     –  <b>Слово і діло</b> (https://www.slovoidilo.ua)
     –  <b>Український тиждень</b> (@tyzhdenUA)

Щоб перевірити канал на недоброчесність або дізнатися більше про критерії перевірки, натисніть одну з кнопок у меню нижче ⬇️
''')


    else:
        bot.send_message(
            message.chat.id, 'Натисніть одну з кнопок у меню, щоб продовжити взаємодію ⬇️')
        


# блок обробки повідомлення користувача на гілці "Перевірити канал"
def process_link(message):
    respond_process_link(message)

# відповідь бота на запит користувача на гілці "Перевірити канал" з використанням функції check_channel_against_metrics
def respond_process_link(message):
    bot.send_message(message.chat.id, check_channel(message.text))

# Перевіряємо канал за запитом користувача; у разі помилки -- повідомляємо
def check_channel(link):
    try:
        csv_filename = message_extraction.get_messages(link)
        return functions_markers_check.check_channel_against_metrics(csv_filename)
    except Exception as e:
        return f'Щось пішло не так.\nПеревірте, чи покликання дійсне, та надішліть ще раз.'


# налаштовуємо постійний полінг з нульовим інтервалом на час активації програми
bot.polling(none_stop=True, interval=0)